content/programming/kubernetes/kubernetes.org
#+startup: content indent

* Kubernetes
#+INDEX: Giovanni's Diary!Programming!Kubernetes

I started playing with kubernetes just out of curosity, creating
some clusters locally. I then had the opportunity to work on tracing
kernel functions with eBPF programs in a kubernetes cluster so I
started looking deeper into kubernetes by writing an operator.

The main issue I have with kubernetes is that everything uses *go*
lang, and I don't like go. The language makes some opinable decisions
and really bad ones. For examples, there are no enums, no macros,
there is an init function but not a destroy one, no RAII, no
templates.. I could go on for a while, It feels like It is going
backwards.

If you want to learn kubernetes, check out some [[file:kubernetes-resources.org][resources]].

---

Travel: [[file:../programming.org][Programming]], [[file:../../theindex.org][Index]]
