public/programming/kubernetes/kubernetes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../programming.html">Programming</a> &gt;
</p>

<div id="outline-container-org0d82351" class="outline-2">
<h2 id="org0d82351">Kubernetes</h2>
<div class="outline-text-2" id="text-org0d82351">
<p>
I started playing with kubernetes just out of curosity, creating
some clusters locally. I then had the opportunity to work on tracing
kernel functions with eBPF programs in a kubernetes cluster so I
started looking deeper into kubernetes by writing an operator.
</p>

<p>
The main issue I have with kubernetes is that everything uses <b>go</b>
lang, and I don't like go. The language makes some opinable decisions
and really bad ones. For examples, there are no enums, no macros,
there is an init function but not a destroy one, no RAII, no
templates.. I could go on for a while, It feels like It is going
backwards.
</p>

<p>
If you want to learn kubernetes, check out some <a href="kubernetes-resources.html">resources</a>.
</p>

<hr />

<p>
Travel: <a href="../programming.html">Programming</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
